package by.company.task;

//Вычислить значение выражения по формуле (все переменные принимают действительные
//значения):
public class task2 {

    public static void main(String[] args) {

        double a = 2;
        double b = 8;
        double c = -3;
        double d = 4;

        double y;

        y = (a / c) * (b / d) - (a * b - c) / (c * d);
        System.out.println(y);
    }
}
