package by.company.task;

//Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру
//7, в противном случае – цифру 8

public class task4 {
    public static void main(String[] args) {

        int x = 9;
        int y = 19;

        if (x < y) {
            System.out.println("7");
        } else {
            System.out.println("8");
        }

    }
}
