package by.company.task;

// 10. С помощью оператора while напишите программу вывода всех четных чисел в диапазоне
//от 2 до 100 включительно.

public class task10 {
    public static void main(String[] args) {
        int x = 2;

        while (x <= 100) {
            System.out.println(x);
            x += 2;
        }

    }
}
